Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64MC804.h
#define _DFLT1CON_IMV_POSITION                   0x00000009
#define _DFLT1CON_IMV_MASK                       0x00000600
#define _DFLT1CON_IMV_LENGTH                     0x00000002

#define _DFLT1CON_QECK0_POSITION                 0x00000004
#define _DFLT1CON_QECK0_MASK                     0x00000010
#define _DFLT1CON_QECK0_LENGTH                   0x00000001

#define _DFLT1CON_QECK1_POSITION                 0x00000005
#define _DFLT1CON_QECK1_MASK                     0x00000020
#define _DFLT1CON_QECK1_LENGTH                   0x00000001

#define _DFLT1CON_QECK2_POSITION                 0x00000006
#define _DFLT1CON_QECK2_MASK                     0x00000040
#define _DFLT1CON_QECK2_LENGTH                   0x00000001

#define _DFLT1CON_IMV0_POSITION                  0x00000009
#define _DFLT1CON_IMV0_MASK                      0x00000200
#define _DFLT1CON_IMV0_LENGTH                    0x00000001

#define _DFLT1CON_IMV1_POSITION                  0x0000000A
#define _DFLT1CON_IMV1_MASK                      0x00000400
#define _DFLT1CON_IMV1_LENGTH                    0x00000001

#define _DFLTCON_QECK_POSITION                   0x00000004
#define _DFLTCON_QECK_MASK                       0x00000070
#define _DFLTCON_QECK_LENGTH                     0x00000003

#define _DFLTCON_QEOUT_POSITION                  0x00000007
#define _DFLTCON_QEOUT_MASK                      0x00000080
#define _DFLTCON_QEOUT_LENGTH                    0x00000001

#define _DFLTCON_CEID_POSITION                   0x00000008
#define _DFLTCON_CEID_MASK                       0x00000100
#define _DFLTCON_CEID_LENGTH                     0x00000001

#define _DFLTCON_IMV_POSITION                    0x00000009
#define _DFLTCON_IMV_MASK                        0x00000600
#define _DFLTCON_IMV_LENGTH                      0x00000002

#define _DFLTCON_QECK0_POSITION                  0x00000004
#define _DFLTCON_QECK0_MASK                      0x00000010
#define _DFLTCON_QECK0_LENGTH                    0x00000001

#define _DFLTCON_QECK1_POSITION                  0x00000005
#define _DFLTCON_QECK1_MASK                      0x00000020
#define _DFLTCON_QECK1_LENGTH                    0x00000001

#define _DFLTCON_QECK2_POSITION                  0x00000006
#define _DFLTCON_QECK2_MASK                      0x00000040
#define _DFLTCON_QECK2_LENGTH                    0x00000001

#define _DFLTCON_IMV0_POSITION                   0x00000009
#define _DFLTCON_IMV0_MASK                       0x00000200
#define _DFLTCON_IMV0_LENGTH                     0x00000001

#define _DFLTCON_IMV1_POSITION                   0x0000000A
#define _DFLTCON_IMV1_MASK                       0x00000400
#define _DFLTCON_IMV1_LENGTH                     0x00000001

#define _QEI2CON_UPDN_SRC_POSITION               0x00000000
#define _QEI2CON_UPDN_SRC_MASK                   0x00000001
#define _QEI2CON_UPDN_SRC_LENGTH                 0x00000001

#define _QEI2CON_TQCS_POSITION                   0x00000001
#define _QEI2CON_TQCS_MASK                       0x00000002
#define _QEI2CON_TQCS_LENGTH                     0x00000001

#define _QEI2CON_POSRES_POSITION                 0x00000002
#define _QEI2CON_POSRES_MASK                     0x00000004
#define _QEI2CON_POSRES_LENGTH                   0x00000001

#define _QEI2CON_TQCKPS_POSITION                 0x00000003
#define _QEI2CON_TQCKPS_MASK                     0x00000018
#define _QEI2CON_TQCKPS_LENGTH                   0x00000002

#define _QEI2CON_TQGATE_POSITION                 0x00000005
#define _QEI2CON_TQGATE_MASK                     0x00000020
#define _QEI2CON_TQGATE_LENGTH                   0x00000001

#define _QEI2CON_PCDOUT_POSITION                 0x00000006
#define _QEI2CON_PCDOUT_MASK                     0x00000040
#define _QEI2CON_PCDOUT_LENGTH                   0x00000001

#define _QEI2CON_SWPAB_POSITION                  0x00000007
#define _QEI2CON_SWPAB_MASK                      0x00000080
#define _QEI2CON_SWPAB_LENGTH                    0x00000001

#define _QEI2CON_QEIM_POSITION                   0x00000008
#define _QEI2CON_QEIM_MASK                       0x00000700
#define _QEI2CON_QEIM_LENGTH                     0x00000003

#define _QEI2CON_UPDN_POSITION                   0x0000000B
#define _QEI2CON_UPDN_MASK                       0x00000800
#define _QEI2CON_UPDN_LENGTH                     0x00000001

#define _QEI2CON_INDX_POSITION                   0x0000000C
#define _QEI2CON_INDX_MASK                       0x00001000
#define _QEI2CON_INDX_LENGTH                     0x00000001

#define _QEI2CON_QEISIDL_POSITION                0x0000000D
#define _QEI2CON_QEISIDL_MASK                    0x00002000
#define _QEI2CON_QEISIDL_LENGTH                  0x00000001

#define _QEI2CON_CNTERR_POSITION                 0x0000000F
#define _QEI2CON_CNTERR_MASK                     0x00008000
#define _QEI2CON_CNTERR_LENGTH                   0x00000001

#define _QEI2CON_TQCKPS0_POSITION                0x00000003
#define _QEI2CON_TQCKPS0_MASK                    0x00000008
#define _QEI2CON_TQCKPS0_LENGTH                  0x00000001

#define _QEI2CON_TQCKPS1_POSITION                0x00000004
#define _QEI2CON_TQCKPS1_MASK                    0x00000010
#define _QEI2CON_TQCKPS1_LENGTH                  0x00000001

#define _QEI2CON_QEIM0_POSITION                  0x00000008
#define _QEI2CON_QEIM0_MASK                      0x00000100
#define _QEI2CON_QEIM0_LENGTH                    0x00000001

#define _QEI2CON_QEIM1_POSITION                  0x00000009
#define _QEI2CON_QEIM1_MASK                      0x00000200
#define _QEI2CON_QEIM1_LENGTH                    0x00000001

#define _QEI2CON_QEIM2_POSITION                  0x0000000A
#define _QEI2CON_QEIM2_MASK                      0x00000400
#define _QEI2CON_QEIM2_LENGTH                    0x00000001

#define _DFLT2CON_QECK_POSITION                  0x00000004
#define _DFLT2CON_QECK_MASK                      0x00000070
#define _DFLT2CON_QECK_LENGTH                    0x00000003

#define _DFLT2CON_QEOUT_POSITION                 0x00000007
#define _DFLT2CON_QEOUT_MASK                     0x00000080
#define _DFLT2CON_QEOUT_LENGTH                   0x00000001

