Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64MC804.h
#define _C1FIFO_FNRB2_POSITION                   0x00000002
#define _C1FIFO_FNRB2_MASK                       0x00000004
#define _C1FIFO_FNRB2_LENGTH                     0x00000001

#define _C1FIFO_FNRB3_POSITION                   0x00000003
#define _C1FIFO_FNRB3_MASK                       0x00000008
#define _C1FIFO_FNRB3_LENGTH                     0x00000001

#define _C1FIFO_FNRB4_POSITION                   0x00000004
#define _C1FIFO_FNRB4_MASK                       0x00000010
#define _C1FIFO_FNRB4_LENGTH                     0x00000001

#define _C1FIFO_FNRB5_POSITION                   0x00000005
#define _C1FIFO_FNRB5_MASK                       0x00000020
#define _C1FIFO_FNRB5_LENGTH                     0x00000001

#define _C1FIFO_FBP0_POSITION                    0x00000008
#define _C1FIFO_FBP0_MASK                        0x00000100
#define _C1FIFO_FBP0_LENGTH                      0x00000001

#define _C1FIFO_FBP1_POSITION                    0x00000009
#define _C1FIFO_FBP1_MASK                        0x00000200
#define _C1FIFO_FBP1_LENGTH                      0x00000001

#define _C1FIFO_FBP2_POSITION                    0x0000000A
#define _C1FIFO_FBP2_MASK                        0x00000400
#define _C1FIFO_FBP2_LENGTH                      0x00000001

#define _C1FIFO_FBP3_POSITION                    0x0000000B
#define _C1FIFO_FBP3_MASK                        0x00000800
#define _C1FIFO_FBP3_LENGTH                      0x00000001

#define _C1FIFO_FBP4_POSITION                    0x0000000C
#define _C1FIFO_FBP4_MASK                        0x00001000
#define _C1FIFO_FBP4_LENGTH                      0x00000001

#define _C1FIFO_FBP5_POSITION                    0x0000000D
#define _C1FIFO_FBP5_MASK                        0x00002000
#define _C1FIFO_FBP5_LENGTH                      0x00000001

#define _C1INTF_TBIF_POSITION                    0x00000000
#define _C1INTF_TBIF_MASK                        0x00000001
#define _C1INTF_TBIF_LENGTH                      0x00000001

#define _C1INTF_RBIF_POSITION                    0x00000001
#define _C1INTF_RBIF_MASK                        0x00000002
#define _C1INTF_RBIF_LENGTH                      0x00000001

#define _C1INTF_RBOVIF_POSITION                  0x00000002
#define _C1INTF_RBOVIF_MASK                      0x00000004
#define _C1INTF_RBOVIF_LENGTH                    0x00000001

#define _C1INTF_FIFOIF_POSITION                  0x00000003
#define _C1INTF_FIFOIF_MASK                      0x00000008
#define _C1INTF_FIFOIF_LENGTH                    0x00000001

#define _C1INTF_ERRIF_POSITION                   0x00000005
#define _C1INTF_ERRIF_MASK                       0x00000020
#define _C1INTF_ERRIF_LENGTH                     0x00000001

#define _C1INTF_WAKIF_POSITION                   0x00000006
#define _C1INTF_WAKIF_MASK                       0x00000040
#define _C1INTF_WAKIF_LENGTH                     0x00000001

#define _C1INTF_IVRIF_POSITION                   0x00000007
#define _C1INTF_IVRIF_MASK                       0x00000080
#define _C1INTF_IVRIF_LENGTH                     0x00000001

#define _C1INTF_EWARN_POSITION                   0x00000008
#define _C1INTF_EWARN_MASK                       0x00000100
#define _C1INTF_EWARN_LENGTH                     0x00000001

#define _C1INTF_RXWAR_POSITION                   0x00000009
#define _C1INTF_RXWAR_MASK                       0x00000200
#define _C1INTF_RXWAR_LENGTH                     0x00000001

#define _C1INTF_TXWAR_POSITION                   0x0000000A
#define _C1INTF_TXWAR_MASK                       0x00000400
#define _C1INTF_TXWAR_LENGTH                     0x00000001

#define _C1INTF_RXBP_POSITION                    0x0000000B
#define _C1INTF_RXBP_MASK                        0x00000800
#define _C1INTF_RXBP_LENGTH                      0x00000001

#define _C1INTF_TXBP_POSITION                    0x0000000C
#define _C1INTF_TXBP_MASK                        0x00001000
#define _C1INTF_TXBP_LENGTH                      0x00000001

#define _C1INTF_TXBO_POSITION                    0x0000000D
#define _C1INTF_TXBO_MASK                        0x00002000
#define _C1INTF_TXBO_LENGTH                      0x00000001

#define _C1INTE_TBIE_POSITION                    0x00000000
#define _C1INTE_TBIE_MASK                        0x00000001
#define _C1INTE_TBIE_LENGTH                      0x00000001

#define _C1INTE_RBIE_POSITION                    0x00000001
#define _C1INTE_RBIE_MASK                        0x00000002
#define _C1INTE_RBIE_LENGTH                      0x00000001

#define _C1INTE_RBOVIE_POSITION                  0x00000002
#define _C1INTE_RBOVIE_MASK                      0x00000004
#define _C1INTE_RBOVIE_LENGTH                    0x00000001

#define _C1INTE_FIFOIE_POSITION                  0x00000003
#define _C1INTE_FIFOIE_MASK                      0x00000008
#define _C1INTE_FIFOIE_LENGTH                    0x00000001

#define _C1INTE_ERRIE_POSITION                   0x00000005
#define _C1INTE_ERRIE_MASK                       0x00000020
#define _C1INTE_ERRIE_LENGTH                     0x00000001

#define _C1INTE_WAKIE_POSITION                   0x00000006
#define _C1INTE_WAKIE_MASK                       0x00000040
#define _C1INTE_WAKIE_LENGTH                     0x00000001

#define _C1INTE_IVRIE_POSITION                   0x00000007
#define _C1INTE_IVRIE_MASK                       0x00000080
#define _C1INTE_IVRIE_LENGTH                     0x00000001

#define _C1EC_RERRCNT_POSITION                   0x00000000
#define _C1EC_RERRCNT_MASK                       0x000000FF
#define _C1EC_RERRCNT_LENGTH                     0x00000008

#define _C1EC_TERRCNT_POSITION                   0x00000008
#define _C1EC_TERRCNT_MASK                       0x0000FF00
#define _C1EC_TERRCNT_LENGTH                     0x00000008

#define _C1EC_RERRCNT0_POSITION                  0x00000000
#define _C1EC_RERRCNT0_MASK                      0x00000001
#define _C1EC_RERRCNT0_LENGTH                    0x00000001

#define _C1EC_RERRCNT1_POSITION                  0x00000001
#define _C1EC_RERRCNT1_MASK                      0x00000002
#define _C1EC_RERRCNT1_LENGTH                    0x00000001

#define _C1EC_RERRCNT2_POSITION                  0x00000002
#define _C1EC_RERRCNT2_MASK                      0x00000004
#define _C1EC_RERRCNT2_LENGTH                    0x00000001

#define _C1EC_RERRCNT3_POSITION                  0x00000003
#define _C1EC_RERRCNT3_MASK                      0x00000008
#define _C1EC_RERRCNT3_LENGTH                    0x00000001

#define _C1EC_RERRCNT4_POSITION                  0x00000004
#define _C1EC_RERRCNT4_MASK                      0x00000010
#define _C1EC_RERRCNT4_LENGTH                    0x00000001

#define _C1EC_RERRCNT5_POSITION                  0x00000005
#define _C1EC_RERRCNT5_MASK                      0x00000020
#define _C1EC_RERRCNT5_LENGTH                    0x00000001

#define _C1EC_RERRCNT6_POSITION                  0x00000006
#define _C1EC_RERRCNT6_MASK                      0x00000040
#define _C1EC_RERRCNT6_LENGTH                    0x00000001

#define _C1EC_RERRCNT7_POSITION                  0x00000007
#define _C1EC_RERRCNT7_MASK                      0x00000080
#define _C1EC_RERRCNT7_LENGTH                    0x00000001

